package com.xinghai.kotlin.catio.data

/*
 "petID":2,
        "name":"伯曼猫",
        "engName":"Birman",
        "character":"温顺友好，感情丰富",
        "nation":"缅甸",
        "easyOfDisease":"心室肥大症、髋关节发育不良、多囊性肾病",
        "life":"10年",
        "price":"",
        "des":"伯曼猫，也有人将它们称为波曼猫、缅甸圣猫等，它们是中型猫，拉丁学名为Birman。虽然现在在世界各地均有分布，不过传说过去它们只在缅甸生活，并且被寺庙里的僧人所在传入欧洲定型后，伯曼猫先后在发过和英国被确定为固定品种，随后它们漂洋过海也在美国得到认可。伯曼猫具有类似波斯猫和喜玛拉雅猫的体型，以及暹罗猫的斑点。它们骨胳强壮，头宽而圆，鼻直面丰；面颊和耳朵均呈V字形；全身被覆银白色长毛，而面部、耳朵、腿、尾部毛的颜色渐深，四爪则为白色，如同戴了白手套一样，故有“四蹄踏雪”之称。关于伯曼猫的还有一个美丽的传说：几百年前，亚洲的高棉人修建了一座女神庙，供奉有着一双宝石蓝色眼睛的金色女神。虔诚的修士Mum-Ha常常跪在女神像前默默地冥想，他养在庙里的漂亮咪Sinh也坐在他身边注视着女神。在一个漆黑的夜晚，盗贼袭击了庙宇并杀害了Mum-Ha。Mum-Ha死后，Sinh将它的脚放在主人的身上并将脸朝向女神像。正在这时，它的白色毛皮变成了金黄色，黄色的眼睛变成了女神像那样的宝石蓝色，而它的四只白色的腿也变成了土地一样的棕色——但是放在主人身上的脚仍然是雪白的，象征着纯洁。第二天早上，庙里的一百多只白猫全都变成Sinh一样的颜色。自此Sinh不曾离开神坛一步，在七日后也离开世界，带着主人的灵魂进入天堂。从那以后，只要这座庙中有猫死去，人们就会说有个修士的灵魂也随着它去了。正因为带有这种宗教色彩的光环，伯曼猫充满了无线的神秘感，不过想要饲养这样的猫咪可能就比较困难了，因为国内目前还没有引进这个品种，一般都是饲养者从国外带回来的，所以如果碰到有人兜售伯曼猫，一定要问清楚猫咪的来源哦，否则很容易就被骗了。",
        "feature":"不少人会将伯曼猫与布偶猫、暹罗猫混为一谈，其实它们分别是三种不同的猫咪，从它们的来源地我们就能略窥一二，伯曼猫来自缅甸，布偶猫诞生于美国，而暹罗猫则原产于泰国。此外，它们的体型也不尽相同，布偶猫为大型猫，而伯曼猫和暹罗猫体型中等大小。想要更好地认识伯曼猫与其他猫咪的区别，你必须了解它们的形态特征。",
        "characterFeature":"伯曼猫是感情极为丰富的猫咪，它们对主人的感情与对其他人的感情完全不同，它们希望能得到主人的关注和宠爱，也希望主人能抽出时间多陪陪它们。当然，也有些伯曼猫天生就不怕生人，它们甚至能跟生人来个小小的互动，不过这些都并不能代表它们一下就对你产生了感情，想要成为它们心中的那个“他”，你还学要接受更多的考验。但是你不用担心的是，即便是胆小的伯曼猫，它们也不会对你产生敌意，因为它们天生温顺友好，只是有的猫咪需要较长的时间来适应与你的相处。跟波斯猫一样，伯曼猫也有甜美的嗓音，当它们想要主人陪自己的时候，就会聪明地甜甜一叫，主人们只能缴械投降，立马奔向猫咪的怀抱。此外，伯曼猫还是典型的“处女座”猫咪，它们非常爱干净，尽管伯曼猫是家养猫咪，但它们也很渴望到外面的世界去走一走、瞧一瞧，如果家中有一个小的庭院，你会发现伯曼猫会常常隔着玻璃仔细观察着庭院。你可以在给猫咪佩戴牵引绳的情况下带它们出去遛个弯，需要注意的是，当出现其他动物时，要密切关注猫咪的动态，一旦发现有要发起战争的征兆，要立刻进行人为干预。",
        "careKnowledge":"虽然目前国内没有引进伯曼猫，但还是有不少喜欢伯曼猫的人通过各种渠道购买到了猫咪。不过由于身边几乎没有人养过伯曼猫，在如何饲养伯曼猫这个问题上，很多主人都犯了难，其实主人们大可不必将伯曼猫想得有多神秘，它们的养护跟其他猫咪也没有什么特别大的差别，只是在某些细节方面，主人可能要做一些改变。做到定期给波曼猫注射狂犬病等疫苗，当被猫咬伤、挠伤时，应及时到医院治疗。要定期给猫驱虫。如果是不用于繁殖的猫，最好给猫做去势手术。家庭养伯曼猫时，还应注意人吃的食物要尽量保管好，不要让猫啃食。一旦发现被猫啃食过的食物，最好扔掉，不可再食用。用动物的肝脏喂猫时，每周最好不要超过1-2次。否则，伯曼猫吃的过多容易生病。在伯曼猫的生长调教幼波曼猫时，应做到刚柔兼施，刚就是严要求，必要时可给予较强刺激，柔就是态度和蔼，耐心细致，及时地给予奖励。避免打骂和粗暴对待幼猫。使幼猫形成良好的条件反射。当需要抓猫或抱波曼猫时，切忌不可抓波曼猫的耳朵、揪猫的尾巴及抓四肢。否则容易使猫耳朵折断或被猫咬、抓伤。正确的方法应当是：用右手抓起猫的颈部或背部皮肤，迅速用左手去抱猫，同时用右手抚摸猫的头部。对于怀孕的猫来说，最好不要过于偏食，否则会使孕猫过肥，尤其是怀孕后期，否则，会造成孕猫的难产。孕猫在分娩时，应注意保持环境的安静，光线要暗，切忌让人随便观看，更忌动手触摸孕猫。否则的话，将影响孕猫的正常分娩，出现母猫拒哺或食仔现象。猫产仔后，最好不要惊扰母猫，产箱切忌打扫，更忌随便移动位置。切忌不要动仔猫，如需要动时，切忌直接用手去捉，应先带上干净的线手套，或用一块干净的布，在母猫排泄物或分泌物上涂抹一下，再去动仔猫。以防止发生母猫拒捕和食仔现象。伯曼猫死后，要处理好死猫的尸体。无论是正常死亡或是因传染病及中毒死亡的猫的尸体，都要进行深埋或者烧掉。切忌存有侥幸心理，以免造成后患。最好连同死猫的用具也一并埋掉或烧掉，防止传染其他的猫或造成环境污染。在养护过程中如果发现猫咪出现一些异常行为时，要及时向兽医求救，以免出现猫咪患病却得不到及时治疗的情况等。此外，因为饲养伯曼猫的人比较少，主人可以在购买伯曼猫前先翻阅一些资料，了解了猫咪的基本生活习性、易患",
        "feedPoints":"“给伯曼猫只喂猫粮会不会导致一些猫很爱吃动物肝脏并且拒绝吃其他食物。动物肝脏中含有大量的维生素A，但过多地摄入维生素A会导致肌肉僵硬、颈痛、骨骼和关节变形以及肝脏疾病。 动物肝脏： 如果猫的饮食中含有大量高脂肪的鱼类或不新鲜的肥肉，会导致维生素E的摄入不足，进而引起猫的身体脂肪发炎，并极度疼痛。　 高脂食品： 某些生鱼中含有可破坏维生素B1的酶，而维生素B1的缺乏可导致猫的神经疾病，严重时会致命，这种酶可以通过加热得以破坏，所以一定要将鱼做熟以后再喂猫。 生鱼： 虽然猫的饮食应以肉类为主，但如果只给猫喂食肉类食品，会导致矿物质和维生素摄入不均，进而引发严重的骨骼代谢紊乱。 肉： 狗粮与猫粮中的营养物质不尽相同，狗粮中的营养物质不能够满足猫的需求。虽然猫狗都是肉食动物，但狗对营养的需求不如猫大。在为猫补充额外维生素和矿物质时应特别谨慎，过量食用鱼肝油会导致维生素A和维生素D的超量摄入，进而引发骨骼疾病。 鱼肝油： 除了上面所说的这些食物外，主人还要控制好零食的供应量，零食虽小，对猫咪的影响却很大，如果任由猫咪吃零食，它们会比其他猫咪更容易出现肥胖和泌尿系统疾病等。此外，在临床上我们还经常会碰到尿酸过高的伯曼猫，这是因为主人知道猫咪喜欢吃高蛋白食物（如虾等）就不间断供应造成的，主人们一定要引起重视。",
        "imageURL":[
            "http://www.boqii.com/entry/photo/356/0",
            "http://www.boqii.com/entry/photo/356/3891",
            "http://www.boqii.com/entry/photo/356/3890",
            "http://www.boqii.com/entry/photo/356/3889",
            "http://www.boqii.com/entry/photo/356/3888",
            "http://www.boqii.com/entry/photo/356/3887"
        ]
 */
data class CatDetail (
    var name: String,
    var engName: String,
    var character: String,
    var nation: String,
    var easyOfDisease: String,
    var life: String,
    var price: String,
    var des: String,
    var feature: String,
    var characterFeature: String,
    var careKnowledge: String,
    var feedPoints: String,
    var imageURL: MutableList<String>
)